ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_sent_cfg_regs.xml
<module id="SENT_CFG" HW_revision="" description="SENT CFG Registers">
	<register id="RCFG" width="32" page="0" offset="32" internal="0" description="">
		<bitfield id="RX_ENB" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RX_CRCENB" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="RSVD_0" description="" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="RX_PPENB" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="RX_DNIB" description="" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="CRC_WIDTH" description="" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="RX_CRC_WITH_STATUS" description="" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="RX_CRCTYPE" description="" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="15" end="12" width="4" rwaccess="R"/>
		<bitfield id="TTCLK" description="" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="RFDATA" width="32" page="0" offset="36" internal="0" description="">
		<bitfield id="FIFO_RDATA" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="RSDATA" width="32" page="0" offset="40" internal="0" description="">
		<bitfield id="CRC" description="" begin="5" end="0" width="6" rwaccess="R"/>
		<bitfield id="RSVD" description="" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="C" description="" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="DATA" description="" begin="23" end="8" width="16" rwaccess="R"/>
		<bitfield id="MESSAGEID" description="" begin="31" end="24" width="8" rwaccess="R"/>
	</register>
	<register id="RSTAT" width="32" page="0" offset="44" internal="0" description="">
		<bitfield id="RXNIB" description="" begin="3" end="0" width="4" rwaccess="R"/>
		<bitfield id="PP" description="" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="RSVD" description="" begin="7" end="5" width="3" rwaccess="R"/>
		<bitfield id="RXSLOW_ST" description="" begin="12" end="8" width="5" rwaccess="R"/>
		<bitfield id="RXSLOW_ACT" description="" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="RXSLOW_DN" description="" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="RX_SYNC" description="" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="RX_TTCLK" description="" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="RCFG2" width="32" page="0" offset="52" internal="0" description="">
		<bitfield id="FIFO_MODE" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DMA_ENB" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="TSTAMP_DIS" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="NOWR_ERRDATA" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GFILT" description="" begin="11" end="4" width="8" rwaccess="RW"/>
		<bitfield id="RFIFO_TRIGLEV" description="" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="15" end="13" width="3" rwaccess="R"/>
		<bitfield id="MTP_MODE" description="" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="RSVD_0" description="" begin="31" end="20" width="12" rwaccess="R"/>
	</register>
	<register id="RINTFLAG" width="32" page="0" offset="64" internal="0" description="">
		<bitfield id="GLBL" description="" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="RFAST_S1DV" description="" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="RFAST_S2DV" description="" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="RFAST_S3DV" description="" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="RFAST_S4DV" description="" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="RSLOW_DV" description="" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="RSLOW_CRCERR" description="" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="RSLOW_FORMATERR" description="" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="RFAST_S1CRCE" description="" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="RFAST_S2CRCE" description="" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="RFAST_S3CRCE" description="" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="RFAST_S4CRCE" description="" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="RFAST_S1FRME" description="" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="RFAST_S2FRME" description="" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="RFAST_S3FRME" description="" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="RFAST_S4FRME" description="" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="RTIMEOUT_ERR" description="" begin="19" end="16" width="4" rwaccess="R"/>
		<bitfield id="RFAST_SYNCERR25" description="" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="RFAST_SYNCERR" description="" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="FREQDRIFT_ERR" description="" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="RFIFO_TRIGGER" description="" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="RFIFO_OVFERR" description="" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="RFIFO_UNDFERR" description="" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="OVFTRIG_ERR" description="" begin="30" end="26" width="5" rwaccess="R"/>
		<bitfield id="RSVD" description="" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="REINT" width="32" page="0" offset="68" internal="0" description="">
		<bitfield id="RSVD" description="" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="RSVD_1" description="" begin="31" end="31" width="1" rwaccess="R"/>
		<bitfield id="RFAST_S2DV_E" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S3DV_E" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S4DV_E" description="" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="RSLOW_DV_E" description="" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="RSLOW_CRCERR_E" description="" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="RSLOW_FORMATERR_E" description="" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S1CRCE_E" description="" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S2CRCE_E" description="" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S3CRCE_E" description="" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S4CRCE_E" description="" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S1FRME_E" description="" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S2FRME_E" description="" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S3FRME_E" description="" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S4FRME_E" description="" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="RTIMEOUT_ERR_E" description="" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="RFAST_SYNCERR25_E" description="" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_SYNCERR_E" description="" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="FREQDRIFT_ERR_E" description="" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="RFIFO_TRIGGER_E" description="" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="RFIFO_OVFERR_E" description="" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="RFIFO_UNDFERR_E" description="" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="OVFTRIG_ERR_E" description="" begin="30" end="26" width="5" rwaccess="RW"/>
		<bitfield id="RFAST_S1DV_E" description="" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="RSETINT" width="32" page="0" offset="72" internal="0" description="">
		<bitfield id="RSVD_0" description="" begin="31" end="31" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S1DV_S" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S2DV_S" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S3DV_S" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S4DV_S" description="" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="RSLOW_DV_S" description="" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="RSLOW_CRCERR_S" description="" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="RSLOW_FORMATERR_S" description="" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S1CRCE_S" description="" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S2CRCE_S" description="" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S3CRCE_S" description="" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S4CRCE_S" description="" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S1FRME_S" description="" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S2FRME_S" description="" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S3FRME_S" description="" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S4FRME_S" description="" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="RTIMEOUT_ERR_S" description="" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="RFAST_SYNCERR25_S" description="" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_SYNCERR_S" description="" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="FREQDRIFT_ERR_S" description="" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="RFIFO_TRIGGER_S" description="" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="RFIFO_OVFERR_S" description="" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="RFIFO_UNDFERR_S" description="" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="OVFTRIG_ERR_S" description="" begin="30" end="26" width="5" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="RCLRINT" width="32" page="0" offset="76" internal="0" description="">
		<bitfield id="GLBL_CLR" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S1DV_CLR" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S2DV_CLR" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S3DV_CLR" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S4DV_CLR" description="" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="RSLOW_DV_CLR" description="" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="RSLOW_CRCERR_CLR" description="" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="RSLOW_FORMATERR_CLR" description="" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S1CRCE_CLR" description="" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S2CRCE_CLR" description="" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S3CRCE_CLR" description="" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S4CRCE_CLR" description="" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S1FRME_CLR" description="" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S2FRME_CLR" description="" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S3FRME_CLR" description="" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_S4FRME_CLR" description="" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="RTIMEOUT_ERR_CLR" description="" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="RFAST_SYNCERR25_CLR" description="" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="RFAST_SYNCERR_CLR" description="" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="FREQDRIFT_ERR_CLR" description="" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="RFIFO_TRIGGER_CLR" description="" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="RFIFO_OVFERR_CLR" description="" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="RFIFO_UNDFERR_CLR" description="" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="OVFTRIG_ERR_CLR" description="" begin="30" end="26" width="5" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="CSENT_SWR" width="32" page="0" offset="80" internal="0" description="">
		<bitfield id="SWR" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="1" width="31" rwaccess="RW"/>
	</register>
	<register id="DATA0_MAP" width="32" page="0" offset="84" internal="0" description="">
		<bitfield id="D0_NIB0" description="" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="D0_NIB1" description="" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="D0_NIB2" description="" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="D0_NIB3" description="" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="D0_NIB4" description="" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="D0_NIB5" description="" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="D0_NIB6" description="" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="D0_NIB7" description="" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="DATA1_MAP" width="32" page="0" offset="88" internal="0" description="">
		<bitfield id="D1_NIB0" description="" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="D1_NIB1" description="" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="D1_NIB2" description="" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="D1_NIB3" description="" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="D1_NIB4" description="" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="D1_NIB5" description="" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="D1_NIB6" description="" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="D1_NIB7" description="" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="CSENT_TO" width="32" page="0" offset="92" internal="0" description="">
		<bitfield id="TO_VAL" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CSENT_RXD" width="32" page="0" offset="96" internal="0" description="">
		<bitfield id="RXD_I_R" description="" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="RSVD" description="" begin="31" end="1" width="31" rwaccess="R"/>
	</register>
	<register id="RXVAL_CNT" width="32" page="0" offset="100" internal="0" description="">
		<bitfield id="RXVALID_CNT_R" description="" begin="7" end="0" width="8" rwaccess="R"/>
		<bitfield id="RSVD" description="" begin="31" end="8" width="24" rwaccess="R"/>
	</register>
	<register id="RXDEDGE_CNT" width="32" page="0" offset="104" internal="0" description="">
		<bitfield id="RXDEDGE_CNT_R" description="" begin="7" end="0" width="8" rwaccess="R"/>
		<bitfield id="RSVD" description="" begin="31" end="8" width="24" rwaccess="R"/>
	</register>
	<register id="SWR_RXVAL_CNT" width="32" page="0" offset="108" internal="0" description="">
		<bitfield id="SWR_RXVAL_CNT" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="1" width="31" rwaccess="RW"/>
	</register>
	<register id="SWR_RXDEDGE_CNT" width="32" page="0" offset="112" internal="0" description="">
		<bitfield id="SWR_RXDEDGE_CNT" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RSVD" description="" begin="31" end="1" width="31" rwaccess="RW"/>
	</register>
	<register id="CSENT_VERSION" width="32" page="0" offset="124" internal="0" description="">
		<bitfield id="VERSION" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
</module>
